; domain
; ==========================================================
; FILE: domain_advanced.pddl
; ==========================================================
; SATELLITE ADVANCED DOMAIN
;
; VERSIONE STABILE ANTI-OSCILLAZIONE
;
; OBIETTIVI DEL MODELLO:
;
; 1. Ridurre oscillazioni inutili del planner
; 2. Modellare memoria come vero vincolo decisionale
; 3. Distinguere foto HD / SD
; 4. Penalizzare rotazioni eccessive
; 5. Evitare loop locali n <-> ne <-> n
;
; STRATEGIA:
;
; - rotation-cost viene minimizzato nella metric
; - last-dir impedisce ritorno immediato
; - memoria e slot sono hard constraints
; ==========================================================

(define (domain satellite-advanced)

(:requirements
    :typing
    :fluents
    :negative-preconditions
    :conditional-effects
    :equality
)

; ==========================================================
; TYPES
; ==========================================================

(:types
    object
    direction
)

; ==========================================================
; DIRECTIONS
; ==========================================================

(:constants
    n ne e se s sw w nw - direction
)

; ==========================================================
; PREDICATES
; ==========================================================

(:predicates

    ; orientamento corrente
    (pointing ?d - direction)

    ; ultima direzione visitata
    ; usata per evitare oscillazioni immediate
    (last-dir ?d - direction)

    ; oggetto visibile dalla direzione
    (visible ?o - object ?d - direction)

    ; stato immagini
    (taken ?o - object)
    (sent ?o - object)

    ; qualità fotografia
    (photo-hd ?o - object)
    (photo-sd ?o - object)

    ; grafo direzioni
    (next-right ?from ?to - direction)
    (next-left ?from ?to - direction)
)

; ==========================================================
; FUNCTIONS
; ==========================================================

(:functions

    ; energia residua
    (energy)

    ; memoria occupata
    (memory-used)

    ; capacità massima memoria
    (memory-capacity)

    ; massimo 2 foto contemporaneamente
    (photo-count)

    ; penalità rotazioni
    (rotation-cost)
)

; ==========================================================
; ROTATE RIGHT
; ==========================================================

(:action rotate-right

    :parameters (?from ?to - direction)

    :precondition (and

        (pointing ?from)
        (next-right ?from ?to)

        (>= (energy) 1)

        ; evita oscillazione immediata
        (not (last-dir ?to))
    )

    :effect (and

        (not (pointing ?from))
        (pointing ?to)

        ; aggiorna memoria direzione
        (not (last-dir ?from))
        (last-dir ?to)

        ; penalizza rotazioni
        (increase (rotation-cost) 2)

        ; costo energetico
        (decrease (energy) 1)
    )
)

; ==========================================================
; ROTATE LEFT
; ==========================================================

(:action rotate-left

    :parameters (?from ?to - direction)

    :precondition (and

        (pointing ?from)
        (next-left ?from ?to)

        (>= (energy) 1)

        (not (last-dir ?to))
    )

    :effect (and

        (not (pointing ?from))
        (pointing ?to)

        (not (last-dir ?from))
        (last-dir ?to)

        (increase (rotation-cost) 2)

        (decrease (energy) 1)
    )
)

; ==========================================================
; TAKE PICTURE HD
; ==========================================================

(:action take-picture-hd

    :parameters (?o - object ?d - direction)

    :precondition (and

        (pointing ?d)
        (visible ?o ?d)

        (not (taken ?o))
        (not (sent ?o))

        (>= (energy) 2)

        ; massimo 2 foto
        (< (photo-count) 2)

        ; controllo memoria reale
        (<= (+ (memory-used) 10)
            (memory-capacity))
    )

    :effect (and

        (taken ?o)
        (photo-hd ?o)

        (increase (memory-used) 10)
        (increase (photo-count) 1)

        (decrease (energy) 2)
    )
)

; ==========================================================
; TAKE PICTURE SD
; ==========================================================

(:action take-picture-sd

    :parameters (?o - object ?d - direction)

    :precondition (and

        (pointing ?d)
        (visible ?o ?d)

        (not (taken ?o))
        (not (sent ?o))

        (>= (energy) 2)

        (< (photo-count) 2)

        (<= (+ (memory-used) 3)
            (memory-capacity))
    )

    :effect (and

        (taken ?o)
        (photo-sd ?o)

        (increase (memory-used) 3)
        (increase (photo-count) 1)

        (decrease (energy) 2)
    )
)

; ==========================================================
; SEND
; ==========================================================

(:action send

    :parameters (?o - object)

    :precondition (and

        ; invio possibile solo verso Terra
        (pointing n)

        (taken ?o)
        (not (sent ?o))

        (>= (energy) 2)
    )

    :effect (and

        (sent ?o)

        (not (taken ?o))

        (decrease (photo-count) 1)

        (decrease (energy) 2)

        ; libera memoria HD
        (when (photo-hd ?o)
            (decrease (memory-used) 10)
        )

        ; libera memoria SD
        (when (photo-sd ?o)
            (decrease (memory-used) 3)
        )
    )
)

)

; problem
(define (problem satellite-extreme)

(:domain satellite-advanced)

(:objects
    star1 planet1 galaxy1 nebula1 - object
)

(:init

    (pointing n)

    ;; visibility
    (visible star1 se)
    (visible planet1 sw)
    (visible galaxy1 ne)
    (visible nebula1 w)

    ;; numeric fluents
    (= (energy) 120)

    (= (memory-used) 0)

    (= (memory-capacity) 13)

    (= (photo-count) 0)

    (= (rotation-cost) 0)

    ;; direction graph
    (next-right n ne)
    (next-right ne e)
    (next-right e se)
    (next-right se s)
    (next-right s sw)
    (next-right sw w)
    (next-right w nw)
    (next-right nw n)

    (next-left ne n)
    (next-left e ne)
    (next-left se e)
    (next-left s se)
    (next-left sw s)
    (next-left w sw)
    (next-left nw w)
    (next-left n nw)
)

(:goal
    (and

        (sent star1)
        (photo-hd star1)

        (sent planet1)
        (photo-sd planet1)

        (sent galaxy1)
        (photo-hd galaxy1)

        (sent nebula1)
        (photo-sd nebula1)
    )
)

(:metric minimize
    (+ (energy)
       (rotation-cost))
)

)

; plan
1. (rotate-left n nw)
   deleted: (pointing n)
   added: (pointing nw) (last-dir nw)
   changed: (rotation-cost) from 0 to 2, (energy) from 120 to 119
   goals met: 0 of 8
2. (rotate-left nw w)
   deleted: (pointing nw) (last-dir nw)
   added: (pointing w) (last-dir w)
   changed: (rotation-cost) from 2 to 4, (energy) from 119 to 118
   goals met: 0 of 8
3. (take-picture-sd nebula1 w)
   added: (taken nebula1) (photo-sd nebula1)
   changed: (memory-used) from 0 to 3, (photo-count) from 0 to 1, (energy) from 118 to 116
   goals met: 1 of 8
4. (rotate-right w nw)
   deleted: (pointing w) (last-dir w)
   added: (pointing nw) (last-dir nw)
   changed: (rotation-cost) from 4 to 6, (energy) from 116 to 115
   goals met: 1 of 8
5. (rotate-right nw n)
   deleted: (pointing nw) (last-dir nw)
   added: (pointing n) (last-dir n)
   changed: (rotation-cost) from 6 to 8, (energy) from 115 to 114
   goals met: 1 of 8
6. (send nebula1)
   deleted: (taken nebula1)
   added: (sent nebula1)
   changed: (photo-count) from 1 to 0, (energy) from 114 to 112, (memory-used) from 3 to 0
   goals met: 2 of 8
7. (rotate-left n nw)
   deleted: (pointing n) (last-dir n)
   added: (pointing nw) (last-dir nw)
   changed: (rotation-cost) from 8 to 10, (energy) from 112 to 111
   goals met: 2 of 8
8. (rotate-left nw w)
   deleted: (pointing nw) (last-dir nw)
   added: (pointing w) (last-dir w)
   changed: (rotation-cost) from 10 to 12, (energy) from 111 to 110
   goals met: 2 of 8
9. (rotate-left w sw)
   deleted: (pointing w) (last-dir w)
   added: (pointing sw) (last-dir sw)
   changed: (rotation-cost) from 12 to 14, (energy) from 110 to 109
   goals met: 2 of 8
10. (take-picture-sd planet1 sw)
   added: (taken planet1) (photo-sd planet1)
   changed: (memory-used) from 0 to 3, (photo-count) from 0 to 1, (energy) from 109 to 107
   goals met: 3 of 8
11. (rotate-left sw s)
   deleted: (pointing sw) (last-dir sw)
   added: (pointing s) (last-dir s)
   changed: (rotation-cost) from 14 to 16, (energy) from 107 to 106
   goals met: 3 of 8
12. (rotate-left s se)
   deleted: (pointing s) (last-dir s)
   added: (pointing se) (last-dir se)
   changed: (rotation-cost) from 16 to 18, (energy) from 106 to 105
   goals met: 3 of 8
13. (take-picture-hd star1 se)
   added: (taken star1) (photo-hd star1)
   changed: (memory-used) from 3 to 13, (photo-count) from 1 to 2, (energy) from 105 to 103
   goals met: 4 of 8
14. (rotate-left se e)
   deleted: (pointing se) (last-dir se)
   added: (pointing e) (last-dir e)
   changed: (rotation-cost) from 18 to 20, (energy) from 103 to 102
   goals met: 4 of 8
15. (rotate-left e ne)
   deleted: (pointing e) (last-dir e)
   added: (pointing ne) (last-dir ne)
   changed: (rotation-cost) from 20 to 22, (energy) from 102 to 101
   goals met: 4 of 8
16. (rotate-left ne n)
   deleted: (pointing ne) (last-dir ne)
   added: (pointing n) (last-dir n)
   changed: (rotation-cost) from 22 to 24, (energy) from 101 to 100
   goals met: 4 of 8
17. (send star1)
   deleted: (taken star1)
   added: (sent star1)
   changed: (photo-count) from 2 to 1, (energy) from 100 to 98, (memory-used) from 13 to 3
   goals met: 5 of 8
18. (rotate-right n ne)
   deleted: (pointing n) (last-dir n)
   added: (pointing ne) (last-dir ne)
   changed: (rotation-cost) from 24 to 26, (energy) from 98 to 97
   goals met: 5 of 8
19. (take-picture-hd galaxy1 ne)
   added: (taken galaxy1) (photo-hd galaxy1)
   changed: (memory-used) from 3 to 13, (photo-count) from 1 to 2, (energy) from 97 to 95
   goals met: 6 of 8
20. (rotate-left ne n)
   deleted: (pointing ne) (last-dir ne)
   added: (pointing n) (last-dir n)
   changed: (rotation-cost) from 26 to 28, (energy) from 95 to 94
   goals met: 6 of 8
21. (send galaxy1)
   deleted: (taken galaxy1)
   added: (sent galaxy1)
   changed: (photo-count) from 2 to 1, (energy) from 94 to 92, (memory-used) from 13 to 3
   goals met: 7 of 8
22. (send planet1)
   deleted: (taken planet1)
   added: (sent planet1)
   changed: (photo-count) from 1 to 0, (energy) from 92 to 90, (memory-used) from 3 to 0
   goals met: 8 of 8
